# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'bat'
brew 'exa'
brew 'duf'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'fx'
brew 'jq'
brew 'tldr'
brew 'glances'
brew 'procs'
brew 'dog'
brew 'glow'

# Development
brew 'mysql'
brew 'meilisearch'
brew 'redis'
brew 'nvm'
brew 'imagemagick'
brew 'shivammathur/php/php@8.1'
brew 'xdebug@8.1'
brew 'imagick@8.1'
brew 'redis@8.1'
brew 'swoole@8.1'
brew 'nginx'
brew 'dnsmasq'
brew 'awscli'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Apps
cask '1password'
cask 'android-studio'
cask 'audacity'
cask 'alfred'
cask 'cleanshot'
cask 'calibre'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'imageoptim'
cask 'pdf-expert'
cask 'phpmon'
cask 'helo'
cask 'ray'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'iterm2'
cask 'phpstorm'
cask 'paw'
cask 'tint'
cask 'vlc'
cask 'visual-studio-code'
cask 'zoom'
cask 'raycast'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Amphetamine', id: 937984704
mas 'XMind', id: 1327661892
mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'iAWriter', id: 775737590
mas 'Transmit', id: 1436522307
mas 'Termius', id: 1176074088
mas 'Telegram', id: 747648890