# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'bat'
brew 'exa'
brew 'duf'
brew 'ripgrep'
brew 'diff-so-fancy'
brew 'fx'
brew 'jq'
brew 'tldr'
brew 'glances'
brew 'procs'
brew 'dog'
brew 'glow'

# Development
brew 'postgresql'
brew 'redis'
brew 'nvm'
brew 'shivammathur/php/php@8.1'
brew 'xdebug@8.1'
brew 'redis@8.1'
brew 'swoole@8.1'
brew 'nginx'
brew 'awscli'
brew 'rustup-init'

# Apps
cask 'charles'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'tableplus'
cask 'the-unarchiver'
cask 'paw'
cask 'tint'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'jetbrains-toolbox'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'iAWriter', id: 775737590
