# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'meilisearch'
brew 'mariadb'
brew 'nvm'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'docker'
cask 'google-chrome'
cask 'imageoptim'
cask 'phpmon'
cask 'ray'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'
cask 'iterm2'
cask 'phpstorm'
cask 'webstorm'
cask 'android-studio'
cask 'paw'
cask 'tint'
cask 'audacity'
cask 'helo'
cask 'cleanshot'
cask 'dropbox'
cask 'vlc'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Amphetamine', id: 937984704
mas 'XMind', id: 1327661892
mas 'Magnet', id: 441258766
mas 'Spark', id: 1176895641
mas 'iAWriter', id: 775737590